src/InformationRegisters/СоединенияИнформационнойБазы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СоединенияИнформационнойБазы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НачалоСоединения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяКомпьютера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПриложения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДПользователяИБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>НомерСеанса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ОткрытыеФормы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ОткрытыеФормы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаОткрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИмяФормы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Сотрудник является клиентом</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>APIВес</Name>
					<Comment>Вес сотрудника для API, сначала выводятся более тяжелые</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеСокращенное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Comment>Должность сотрудника</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяИБ</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОМС</Name>
					<Comment>Код по ОМС</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛогинОнЛайнКалендаря</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеДляСайтаHTML</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольОнЛайнКалендаря</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеДляОнлайнЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Роль</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РольПользователя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлКартинки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Файлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоПользовательИБ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСинхронизации</Name>
					<Comment>Код синхронизации с ID загружаемой базы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодаСтраны</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаПоследниеЦифры</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СпецилазацииСотрудника</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Специализация</Name>
							<Comment>Специализация</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Специализации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основная</Name>
							<Comment>Основная специализация</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоступныеКассы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Касса</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основная</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоступныеСтруктурныеЕдиницы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтруктурнаяЕдиница</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоступныеСтруктурныеЕдиницыЖурналаЗаписи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтруктурнаяЕдиница</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonModules/ОбсужденияСистемыВзаимодействия/Ext/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2020, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Функция, возвращает результат, возможно ли использовать систему взаимодействия.
//
Функция СистемаВзаимодействияВключена() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		
		СистемаВзаимодействияПодключена = СистемаВзаимодействия.ИнформационнаяБазаЗарегистрирована();
		СистемаВзаимодействияВключена	= Константы.ИспользуетсяСистемаВзаимодействия.Получить();
		
		Возврат СистемаВзаимодействияПодключена И СистемаВзаимодействияВключена;    
		
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

// Процедура - Включить возможность отправлять оповещения через СВ
//
// Параметры:
//  ОтказСистемыВзаимодействия	 - 	 - 
//
Процедура ПроверитьВозможностьОтправлятьОповещенияЧерезСВ(ОтказСистемыВзаимодействия) Экспорт
	
	СистемаВзаимодействияВключена = Константы.ИспользуетсяСистемаВзаимодействия.Получить();
	
	Если ОтказСистемыВзаимодействия = Истина И СистемаВзаимодействияВключена = Истина Тогда
		Константы.ИспользуетсяСистемаВзаимодействия.Установить(Ложь);
	ИначеЕсли ОтказСистемыВзаимодействия = Ложь И СистемаВзаимодействияВключена = Ложь Тогда
		Константы.ИспользуетсяСистемаВзаимодействия.Установить(Истина);
	КонецЕсли;
	
КонецПроцедуры

// Формирует соответствие между идентификаторами пользователей системы взаимодействия
// и элементами справочника Пользователи.
//
// Параметры:
// 	ПользователиСистемыВзаимодействия - Массив Из ИдентификаторПользователяСистемыВзаимодействия
// 									  - КоллекцияИдентификаторовПользователейСистемыВзаимодействия 
// 
// Возвращаемое значение:
// 	Соответствие из КлючИЗначение:
// 	* Ключ - ИдентификаторПользователяСистемыВзаимодействия
// 	* Значение - см. ПользовательИнформационнойБазы
//
Функция ПользователиИнформационнойБазы(ПользователиСистемыВзаимодействия)Экспорт
	
	ТипыВходныхПараметров = Новый Массив;
	ТипыВходныхПараметров.Добавить(Тип("КоллекцияИдентификаторовПользователейСистемыВзаимодействия"));
	ТипыВходныхПараметров.Добавить(Тип("Массив"));
	
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр("ПользователиИнформационнойБазы",
												   "ПользователиСистемыВзаимодействия",
												   ПользователиСистемыВзаимодействия,
												   ТипыВходныхПараметров);
	
	Результат = Новый Соответствие;
	Ошибки = Новый Массив;
	Для каждого Идентификатор Из ПользователиСистемыВзаимодействия Цикл
		Попытка
			Результат.Вставить(Идентификатор, ПользовательИнформационнойБазы(Идентификатор));
		Исключение
			Ошибки.Добавить(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			Результат.Вставить(Идентификатор, Неопределено);
		КонецПопытки;
	КонецЦикла;
	
	Если Ошибки.Количество() > 0 Тогда
		
		ЗаписьЖурналаРегистрации(ОбсужденияСистемыВзаимодействияСлужебный.СобытиеЖурналаРегистрации(
			НСтр("ru='Пользователи информационной базы'", ОбщегоНазначения.КодОсновногоЯзыка())),
			УровеньЖурналаРегистрации.Ошибка,,,
			СтрСоединить(Ошибки, Символы.ПС + Символы.ПС));
		
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

// Выполняет поиск элемента справочника Пользователи по идентификатору пользователя Системы Взаимодействия.
//
// Выбрасывает исключение, если пользователь не был найден.
//
// Параметры:
// 	ПользовательСистемыВзаимодействия - ИдентификаторПользователяСистемыВзаимодействия.
//
// Возвращаемое значение:
// 	СправочникСсылка.Пользователи
//
Функция ПользовательИнформационнойБазы(ПользовательСистемыВзаимодействия) Экспорт
	
	Результат = Неопределено;
	
	ПользовательСВ = СистемаВзаимодействия.ПолучитьПользователя(ПользовательСистемыВзаимодействия);
	Результат = Справочники.Сотрудники.НайтиПоРеквизиту("ИдентификаторПользователяИБ", ПользовательСВ.ИдентификаторПользователяИнформационнойБазы);
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		
		ШаблонОшибки = НСтр("ru='Не удалось получить пользователя информационной базы по идентификатору пользователя системы взаимодействия (%1)'");
		ОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонОшибки, Строка(ПользовательСистемыВзаимодействия));
		ВызватьИсключение ОписаниеОшибки;
		
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции

// Формирует соответствие между элементами справочника Пользователи
// и идентификаторами пользователей системы взаимодействия.
//  
// Если пользователь не найден, то будет попытка создать пользователя системы взаимодействия.
// Если пользователь не найден и при создании нового пользователя было выброшено исключение,
// то возвращается Неопределено.
//
// Параметры:
// 	ПользователиИнформационнойБазы - Массив Из СправочникСсылка.Пользователи
// 
// Возвращаемое значение:
// 	Соответствие:
// 	* Ключ - СправочникСсылка.Пользователи
// 	* Значение - см. ПользовательСистемыВзаимодействия
//
Функция ПользователиСистемыВзаимодействия(ПользователиИнформационнойБазы) Экспорт
	
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр("ПользователиСистемыВзаимодействия",
												   "ПользователиИнформационнойБазы",
												   ПользователиИнформационнойБазы,
												   Тип("Массив"));
	
	Результат = Новый Соответствие;
	Ошибки 	  = Новый Массив;
	
	Для каждого Пользователь Из ПользователиИнформационнойБазы Цикл
		
		Попытка
			Результат.Вставить(Пользователь, ПользовательСистемыВзаимодействия(Пользователь));
		Исключение
			Ошибки.Добавить(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			Результат.Вставить(Пользователь, Неопределено);
		КонецПопытки;
		
	КонецЦикла;
	
	Если Ошибки.Количество() > 0 Тогда
		
		ЗаписьЖурналаРегистрации(ОбсужденияСистемыВзаимодействияСлужебный.СобытиеЖурналаРегистрации(
			НСтр("ru='ПользователиСистемыВзаимодействия'", ОбщегоНазначения.КодОсновногоЯзыка())),
			УровеньЖурналаРегистрации.Ошибка,,,
			СтрСоединить(Ошибки, Символы.ПС));
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Получает идентификатор пользователя системы взаимодействия.
// Если пользователь не найден, то будет выполнена попытка создать нового пользователя.
// 
// Выбрасывает исключение, если:
// - не удалось получить идентификатор пользователя информационной базы;
// - не удалось создать пользователя системы Взаимодействия.
//
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи
// 				 - СправочникОбъект.Пользователи
//
// Возвращаемое значение:
// 	ПользовательСистемыВзаимодействия
//
Функция ПользовательСистемыВзаимодействия(Пользователь) Экспорт
	
	Результат = Неопределено;
	
	УстановитьПривилегированныйРежим(Истина);
	ИдентификаторПользователяИнформационнойБазы = ?(ТипЗнч(Пользователь) = Тип("СправочникОбъект.Сотрудники"),
												    Пользователь.ИдентификаторПользователяИБ,
													ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Пользователь, "ИдентификаторПользователяИБ"));
	УстановитьПривилегированныйРежим(Ложь);
	
	Если Не ЗначениеЗаполнено(ИдентификаторПользователяИнформационнойБазы) Тогда
		ШаблонОшибки = НСтр("ru='Не удалось получить идентификатор пользователя (%1)'");
		ОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонОшибки, Строка(Пользователь));	
		ВызватьИсключение ОписаниеОшибки;
	КонецЕсли;
	
	ОшибкаПолучениеИдентификатораСВ = "";
	
	Попытка
		ИдентификаторПользователяСВ = СистемаВзаимодействия.ПолучитьИдентификаторПользователя(ИдентификаторПользователяИнформационнойБазы);
		Результат = СистемаВзаимодействия.ПолучитьПользователя(ИдентификаторПользователяСВ);
	Исключение
		ОшибкаПолучениеИдентификатораСВ = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	
	Если Результат = Неопределено Тогда
		
		Попытка
			УстановитьПривилегированныйРежим(Истина);
			Результат = НовыйПользовательСистемыВзаимодействия(Пользователь);
			УстановитьПривилегированныйРежим(Ложь);
		Исключение
			Ошибка = ИнформацияОбОшибке();
			ОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='При создании пользователя %1 произошла ошибка.'"), Пользователь);
			ОписаниеОшибки = ОписаниеОшибки + Символы.ПС + ОшибкаПолучениеИдентификатораСВ + Символы.ПС + ПодробноеПредставлениеОшибки(Ошибка);
			ЗаписьЖурналаРегистрации(ОбсужденияСистемыВзаимодействияСлужебный.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки);
			ВызватьИсключение;
		КонецПопытки;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает массив идентификаторов пользователей системы взаимодействия.
//
Функция МассивИдентификаторовПользователейСистемыВзаимодействия(МассивПользователей) Экспорт
	
	МассивИдентификаторовСВ = Новый Массив;
	
	Для каждого Пользователь из МассивПользователей Цикл
		
		Результат = Неопределено;
		
		ИдентификаторПользователяИнформационнойБазы = ?(ТипЗнч(Пользователь) = Тип("СправочникОбъект.Сотрудники"),
														Пользователь.ИдентификаторПользователяИБ,
														ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Пользователь, "ИдентификаторПользователяИБ"));
		
		Если ЗначениеЗаполнено(ИдентификаторПользователяИнформационнойБазы) Тогда
			
			Попытка
				ИдентификаторПользователяСВ = СистемаВзаимодействия.ПолучитьИдентификаторПользователя(ИдентификаторПользователяИнформационнойБазы); 
				Если ЗначениеЗаполнено(ИдентификаторПользователяСВ) Тогда
					МассивИдентификаторовСВ.Добавить(ИдентификаторПользователяСВ);
				КонецЕсли;
			Исключение
				Продолжить;
			КонецПопытки; 
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат МассивИдентификаторовСВ;
	
КонецФункции

// Обновляет дополнительную информацию пользователя системы взаимодействия.
// Например, телефон и адрес электронной почты.
// Если пользователь системы взаимодействия еще не создан, то будет создан новый пользователь
// системы взаимодействия.
//
// Выбрасывает исключение, если обновить пользователя системы взаимодействия не удалось.
//
// Параметры:
// 	Пользователь - СправочникСсылка.Пользователи
// 				 - СправочникОбъект.Пользователи
//
Процедура ОбновитьПользователяВСистемеВзаимодействия(Пользователь) Экспорт
	
	Если Не СистемаВзаимодействияВключена() Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		ПользовательСВ 		 = ПользовательСистемыВзаимодействия(Пользователь);
		ОписаниеПользователя = ОписаниеПользователя(Пользователь);
		ОбновитьОписаниеПользователяВСистемеВзаимодействия(ПользовательСВ, ОписаниеПользователя);
	Исключение
		ОписаниеОшибки = НСтр("ru='Не удалось обновить пользователя системы взаимодействия.'");
		Ошибка 		   = ИнформацияОбОшибке(); 
		
		ЗаписьЖурналаРегистрации(ОбсужденияСистемыВзаимодействияСлужебный.СобытиеЖурналаРегистрации(
				НСтр("ru='Обновить описание в системе взаимодействия'", ОбщегоНазначения.КодОсновногоЯзыка())),
				УровеньЖурналаРегистрации.Ошибка,
				Пользователь.Метаданные(),
				Пользователь.Ссылка,
				ОписаниеОшибки + Символы.ПС + ПодробноеПредставлениеОшибки(Ошибка)
		);
	КонецПопытки;
	
КонецПроцедуры

// Формирует описание сообщение для отправки сообщения через процедуры
// и функции подсистемы Обсуждения.
//
// Параметры:
// 	Текст - Строка - текст сообщения системы Взаимодействия
// 		  - ФорматированнаяСтрока
//
// Возвращаемое значение:
//   Структура:
// 	* Текст - ФорматированнаяСтрока
// 	* Вложения - Массив Из см. ОписаниеВложения
// 	* Действия - СписокЗначений - см. синтакс-помощник СообщениеСистемыВзаимодействия
//
Функция ОписаниеСообщения(Знач Текст) Экспорт
	
	Описание = Новый Структура;
	
	Если ТипЗнч(Текст) = Тип("Строка") Тогда
		Текст = Новый ФорматированнаяСтрока(Текст);
	КонецЕсли;
	
	Описание.Вставить("Текст", Текст);
	Описание.Вставить("Вложения", Новый Массив);
	Описание.Вставить("Действия", Новый СписокЗначений);
	Возврат Описание;
	
КонецФункции

// Формирует описание вложения для отправки сообщения через процедуры
// и функции подсистемы Обсуждения.
//
// Параметры:
// 	Поток - Поток - поток, из которого будет создано вложение системы Взаимодействия.
// 		  - ПотокВПамяти
// 		  - ФайловыйПоток
// 	Наименование - Строка
// 
// Возвращаемое значение:
// 	Структура:
// 	* Поток - Поток - поток, из которого будет создано вложение системы взаимодействия.
// 			- ПотокВПамяти
// 			- ФайловыйПоток
// 	* Наименование - Строка
// 	* ТипСодержимого - Строка
// 	* Отображаемое - Булево - значение по умолчанию Истина
//
Функция ОписаниеВложения(Поток, Наименование) Экспорт
	
	Описание = Новый Структура;
	Описание.Вставить("Поток", Поток);
	Описание.Вставить("Наименование", Наименование);
	Описание.Вставить("ТипСодержимого", "");
	Описание.Вставить("Отображаемое", Истина);
	Возврат Описание;
	
КонецФункции

// Проверяет, существует ли такое обсуждение.
//
Функция ОбсуждениеСуществует(ИдентификаторОбсуждения) Экспорт
	
	Попытка
		Возврат СистемаВзаимодействия.ПолучитьОбсуждение(ИдентификаторОбсуждения) <> Неопределено;
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

// Процедура, добавляет оповещение обсуждению.
// Параметры:
// ДанныеСообщения - тип - Произвольный.
// Сотрудники - можно передать как массив с сотрудниками, так и ссылку на сотрудника, либо пользователей.
// ПользователиИБ - массив с пользователями информационной базы для получения сотрудников.
// В ДанныеСообщения нельзя передавать пустые ссылки!!!.
//
Процедура ДобавитьСообщениеВСистемуВзаимодействия(ДанныеСообщения, Сотрудники = Неопределено, ПользователиИБ = Неопределено) Экспорт
	
	#Если НЕ ВнешнееСоединение Тогда
		
		Попытка
			ИдентификаторПользователя = ПолучитьИдентификаторПользователяСистемыВзаимодействия();
			Если ИдентификаторПользователя = Неопределено Тогда
				Возврат;
			КонецЕсли;
			
			// Получаем ключи обсуждения для каждого пользователя.
			ТаблицаКлючейОбсуждения = ПолучитьКлючиОбсужденийПользователей(Сотрудники, ПользователиИБ); 
			
			Для каждого СтрокаТаблицы Из ТаблицаКлючейОбсуждения Цикл
				
				Если ЗначениеЗаполнено(СтрокаТаблицы.КлючОбсуждения) Тогда
					
					ИдентификаторОбсуждения = ОбсужденияСистемыВзаимодействияСлужебный.ПолучитьИдентификаторОбсуждения(СтрокаТаблицы.КлючОбсуждения);
					
					Если ИдентификаторОбсуждения = Неопределено Тогда
						Продолжить;
					КонецЕсли;
					
					Сообщение = СистемаВзаимодействия.СоздатьСообщение(ИдентификаторОбсуждения); 
					Сообщение.Данные = ДанныеСообщения; 
					ДанныеСообщения.Свойство("Ключ", Сообщение.Текст);
					Сообщение.Записать();
					
				КонецЕсли;   
				
			КонецЦикла;
		Исключение 
			
		КонецПопытки;
	#КонецЕсли
	
КонецПроцедуры

// Функция, возвращает массив с ключами обсуждения для переданных пользователей.
//
Функция ПолучитьКлючиОбсужденийПользователей(Сотрудники, ПользователиИБ) Экспорт
	
	ТаблицаКлючейОбсуждения = Новый ТаблицаЗначений;
	ТаблицаКлючейОбсуждения.Колонки.Добавить("Сотрудник");
	ТаблицаКлючейОбсуждения.Колонки.Добавить("КлючОбсуждения");
	
	Если ЗначениеЗаполнено(Сотрудники) Тогда
		
		Если ТипЗнч(Сотрудники) = Тип("СправочникСсылка.Пользователи") Тогда
			
			СтрокаТаблицы = ТаблицаКлючейОбсуждения.Добавить();
			СтрокаТаблицы.Сотрудник 	 = Сотрудники;
			СтрокаТаблицы.КлючОбсуждения = Строка(Сотрудники.ИдентификаторПользователяИБ);
			
		Иначе
			
			ПользователиИБ = ПолучитьСписокСотрудниковПоСотрудникам(Сотрудники);		
			Для Каждого Пользователь из ПользователиИБ Цикл
				
				СтрокаТаблицы = ТаблицаКлючейОбсуждения.Добавить();
				СтрокаТаблицы.Сотрудник 	 = Пользователь;
				СтрокаТаблицы.КлючОбсуждения = Строка(Пользователь.ИдентификаторПользователяИБ);		
				
			КонецЦикла;
			
		КонецЕсли;
	
	ИначеЕсли ЗначениеЗаполнено(ПользователиИБ) Тогда
		
		Если ТипЗнч(ПользователиИБ) = Тип("Массив") Тогда
			
			ПользователиИБ = ПолучитьМассивУникальныхПользователей(ПользователиИБ);
			Для Каждого Пользователь из ПользователиИБ Цикл
				
				СтрокаТаблицы = ТаблицаКлючейОбсуждения.Добавить();
				СтрокаТаблицы.Сотрудник 	 = Пользователь;
				СтрокаТаблицы.КлючОбсуждения = Строка(Пользователь.УникальныйИдентификатор);		
				
			КонецЦикла;   
			
		Иначе 
			
			СтрокаТаблицы = ТаблицаКлючейОбсуждения.Добавить();
			СтрокаТаблицы.Сотрудник 	 = ПользователиИБ;
			СтрокаТаблицы.КлючОбсуждения = Строка(ПользователиИБ.УникальныйИдентификатор);
			
		КонецЕсли;
	
	КонецЕсли;
	
	Возврат ТаблицаКлючейОбсуждения;
	
КонецФункции

// Функция, проверяет может ли текущий пользователь зарегистрировать базу в системе взаимодействия.
//
Функция ПроверитьВозможностьРегистрацииСистемыВзаимодействия() Экспорт

	Попытка
		Если РольДоступна("ПолныеПрава") И НЕ СистемаВзаимодействия.ИнформационнаяБазаЗарегистрирована() Тогда
			Возврат ?(ПравоДоступа("РегистрацияИнформационнойБазыСистемыВзаимодействия", Метаданные), Истина, Ложь);
		Иначе
			Возврат Ложь;
		КонецЕсли;
	Исключение
		Возврат Ложь;
	КонецПопытки;

КонецФункции

// Функция, возвращает адрес электронной почты для регистрации в системе взаимодейтсвия.
//
Функция ПолучитьАдресПочтыДляРегистрации() Экспорт
	
	// Загружаем логин, который сохраняется при первоначальной настройке информационной базы.
	АдресЭлектроннойПочты = ХранилищеСистемныхНастроек.Загрузить("ЛогинДляРегистрацииВСистемеВзаимодействия", "СистемаВзаимодействия");
	
	// Если он не заполнен, тогда берем логин текущего пользователя.
	Если Не ЗначениеЗаполнено(АдресЭлектроннойПочты) Тогда
		
		ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
		
		EMailСотрудника = ТекущийПользователь.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Вид", Справочники["ВидыКонтактнойИнформации"].EmailПользователя));
		Если ЗначениеЗаполнено(EMailСотрудника) Тогда
			АдресЭлектроннойПочты = EMailСотрудника[0].Представление;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат АдресЭлектроннойПочты;
	
КонецФункции

// Функция - Имя информационной базы для регистрации
// 
// Возвращаемое значение:
//   - 
//
Функция ИмяИнформационнойБазыДляРегистрации() Экспорт

	ИмяБазы = Константы.ЗаголовокСистемы.Получить();
	Если ИмяБазы = "" Тогда
		ИмяБазы = Метаданные.КраткаяИнформация;
	КонецЕсли;
	
	Возврат ИмяБазы;
	
КонецФункции

// Процудура, производит запись в журнал регистрации ошибки.
//
Процедура ЗаписатьДанныеОбОшибкеВЖурналРегистрации(ОписаниеОшибки, КлючОбсуждения = "") Экспорт
	
	ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("ОповещениеВСистемеВзаимодействия", 
	УровеньЖурналаРегистрации.Ошибка,,,
	ОписаниеОшибки + "_" + КлючОбсуждения)
	
КонецПроцедуры

// Процедура, производит запись данные для оповещения клиента.
//
Процедура ПолучитьПараметрыТекущегоПользователяДляОповещения(ДанныеКлиентаСистемыВзаимодействия) Экспорт
	
	ДанныеКлиентаСистемыВзаимодействия = Новый Структура;
	ДанныеКлиентаСистемыВзаимодействия.Вставить("РабочееМесто"		 			   , ПараметрыСеанса.РабочееМестоКлиента);
	ДанныеКлиентаСистемыВзаимодействия.Вставить("ТекущийПользователь"		       , ПараметрыСеанса.ТекущийПользователь);
	ДанныеКлиентаСистемыВзаимодействия.Вставить("НомерСеанса"		 			   , НомерСеансаИнформационнойБазы()); 
	ДанныеКлиентаСистемыВзаимодействия.Вставить("ТекущаяСтруктурнаяЕдиница"		   , ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница); 
	ДанныеКлиентаСистемыВзаимодействия.Вставить("ДатаНачалаСеанса"				   , НачалоДня(ТекущаяДатаСеанса())); 
	
КонецПроцедуры

// Функция, получает ключ обсуждения в системе взаимодействия для журнала оповещений
//
Функция КлючОбсужденияЖурналаОповещений(Ключ = Неопределено, ОтказСистемыВзаимодействия = Ложь) Экспорт
	
	Обсуждение = Неопределено;  
	
	Попытка
		Если Не ЗначениеЗаполнено(Ключ) Тогда
			ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
			Ключ = Строка(ТекущийПользователь.ИдентификаторПользователяИБ);	
		КонецЕсли;
		
		#Если НЕ ВнешнееСоединение Тогда
			
			Если НЕ СистемаВзаимодействия.ИнформационнаяБазаЗарегистрирована() Тогда
				Возврат Обсуждение;
			КонецЕсли;
			
			УстановитьПривилегированныйРежим(Истина);
			Попытка
				Обсуждение = СистемаВзаимодействия.ПолучитьОбсуждение(Ключ);
			Исключение
            	ОтказСистемыВзаимодействия = Истина;
			КонецПопытки;
			
			ПроверитьВозможностьОтправлятьОповещенияЧерезСВ(ОтказСистемыВзаимодействия);

			УстановитьПривилегированныйРежим(Ложь);
			
		#КонецЕсли
	Исключение 
		Возврат Неопределено;
	КонецПопытки;
	
	Если Обсуждение = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Обсуждение.Идентификатор;
	
КонецФункции

// Функция, возвращает обсуждение в системе взаимодействия для текущего пользователя.
//
Функция ПолучитьОбсуждениеСотрудника(Сотрудник = Неопределено, ОтказСистемыВзаимодействия = Ложь) Экспорт
	
	Если Сотрудник = Неопределено Тогда
		Сотрудник = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;

	КлючОбсуждения = Строка(Сотрудник.ИдентификаторПользователяИБ);
	
	Обсуждение = КлючОбсужденияЖурналаОповещений(КлючОбсуждения, ОтказСистемыВзаимодействия);
	Если Обсуждение <> Неопределено Тогда
		Возврат КлючОбсуждения; 
	КонецЕсли;
	
	Возврат Неопределено; 
	
КонецФункции

// Функция - Получить массив активных сотрудников
//
// Параметры:
//  Сотрудники	 - 	 - 
//  РабочиеМеста - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьМассивАктивныхСотрудников(Сотрудники = Неопределено, 
								          РабочиеМеста = Неопределено, 
										  НомераСеансов = Неопределено,
										  СтруктурнаяЕдиница = Неопределено,
										  РольПользователя = Неопределено) Экспорт
										  
	Если Не ЗначениеЗаполнено(Сотрудники) И Не ЗначениеЗаполнено(РабочиеМеста) И Не ЗначениеЗаполнено(НомераСеансов) И Не ЗначениеЗаполнено(СтруктурнаяЕдиница) Тогда
		Возврат Новый Массив;
	КонецЕсли;
											  									  									  
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	СоединенияИнформационнойБазы.Пользователь КАК Сотрудник
	|ПОМЕСТИТЬ ВтАктивныеСотрудники
	|ИЗ
	|	РегистрСведений.СоединенияИнформационнойБазы КАК СоединенияИнформационнойБазы
	|ГДЕ
	|	СоединенияИнформационнойБазы.Активен = ИСТИНА
	|	И &УсловиеСотрудники
	|	И &УсловиеРабочиеМеста
	|	И &УсловиеНомераСеансов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Сотрудники.Ссылка КАК Сотрудник
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтАктивныеСотрудники КАК ВтАктивныеСотрудники
	|		ПО (ВтАктивныеСотрудники.Сотрудник = Сотрудники.Ссылка)
	|ГДЕ
	|	Сотрудники.ПометкаУдаления = ЛОЖЬ
	|	И &УсловиеСтруктурнаяЕдиница
	|	И &УсловиеРоль");
	
	УсловиеСотрудники         = ?(ЗначениеЗаполнено(Сотрудники)  	   , "И СоединенияИнформационнойБазы.Пользователь В(&Сотрудники)"  , "И Истина");
	УсловиеРабочиеМеста       = ?(ЗначениеЗаполнено(РабочиеМеста) 	   , "И СоединенияИнформационнойБазы.РабочееМесто В(&РабочееМесто)", "И Истина");
	УсловиеНомераСеансов      = ?(ЗначениеЗаполнено(НомераСеансов)	   , "И СоединенияИнформационнойБазы.НомерСеанса В(&НомерСеанса)"  , "И Истина");
	УсловиеСтруктурнаяЕдиница = ?(ЗначениеЗаполнено(СтруктурнаяЕдиница), "И Сотрудники.ДоступныеСтруктурныеЕдиницы.СтруктурнаяЕдиница = &СтруктурнаяЕдиница", "И Истина");
	УсловиеРольПользователя   = ?(ЗначениеЗаполнено(РольПользователя)  , "И Сотрудники.Роль = &РольПользователя", "И Истина");
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &УсловиеСотрудники"   	    , УсловиеСотрудники);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &УсловиеРабочиеМеста" 	    , УсловиеРабочиеМеста);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &УсловиеНомераСеансов"	    , УсловиеНомераСеансов);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &УсловиеСтруктурнаяЕдиница" , УсловиеСтруктурнаяЕдиница);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &УсловиеРоль"				, УсловиеРольПользователя);
	
	Запрос.УстановитьПараметр("РабочееМесто"	  , РабочиеМеста);
	Запрос.УстановитьПараметр("Сотрудники"  	  , Сотрудники);
	Запрос.УстановитьПараметр("НомерСеанса" 	  , НомераСеансов);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("РольПользователя"  , РольПользователя);	
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Сотрудник");
	
КонецФункции

// Процедура, устанавливает значение константе.
// Если база зарегистрировалась - Истина, иначе - Ложь
//
Процедура УстановитьЗначениеКонстанте(Значение) Экспорт
	Константы.ИспользуетсяСистемаВзаимодействия.Установить(Значение);
КонецПроцедуры

// Функция - Регистрировать систему взаимодействия при первом входе
// 
// Возвращаемое значение:
//   - 
//
Функция РегистрироватьСистемуВзаимодействияПриПервомВходе() Экспорт

	Возврат Константы.РегистрироватьСистемуВзаимодействияПриПервомВходе.Получить() = Истина;
	
КонецФункции

// Процедура - Значение константы регистрировать систему взаимодействия
//
// Параметры:
//  Значение - 	 - 
//
Процедура ЗначениеКонстантыРегистрироватьСистемуВзаимодействия(Значение) Экспорт

	Константы.РегистрироватьСистемуВзаимодействияПриПервомВходе.Установить(Значение);
	
КонецПроцедуры

// Функция - Проверить заполненность элемента
// В системы взаимодействия нельзя отправлять пустые ссылки!
// Параметры:
//  Элемент	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПроверитьЗаполненностьЭлемента(Элемент, ЗначениеПоУмолчанию = Неопределено) Экспорт

	Возврат ?(ЗначениеЗаполнено(Элемент), Элемент, ЗначениеПоУмолчанию);
	
КонецФункции

// Функция - Данные для регистрации системы взаимодействия
//
// Параметры:
//  ЭтоОблако	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ДанныеДляРегистрацииСистемыВзаимодействия(ЭтоОблако = Ложь) Экспорт

	ДанныеРегистрации = Новый Структура;
	
	Если ЭтоОблако = Истина Тогда
		ИмяИнформационнойБазы = ЛичныйКабинет.ПолучитьНомерОбласти();	
	Иначе
		ИмяИнформационнойБазы = ОбсужденияСистемыВзаимодействия.ИмяИнформационнойБазыДляРегистрации();
	КонецЕсли;	
	
	Сервер 				  = "ws://collab.stoma1c.ru:8081";
	АдресЭлектроннойПочты = ОбсужденияСистемыВзаимодействия.ПолучитьАдресПочтыДляРегистрации();
    КодРегистрации		  = Формат(ТекущаяДата(), "DF=""yyyyMMddHHmmss""");
	
	ДанныеРегистрации.Вставить("Сервер"				  , Сервер);
	ДанныеРегистрации.Вставить("ИмяИнформационнойБазы", ИмяИнформационнойБазы);
	ДанныеРегистрации.Вставить("АдресЭлектроннойПочты", ?(ЗначениеЗаполнено(АдресЭлектроннойПочты), АдресЭлектроннойПочты, ИмяИнформационнойБазы));
	ДанныеРегистрации.Вставить("КодРегистрации"		  , КодРегистрации);
	
	Возврат ДанныеРегистрации;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция, возвращает список сотрудников, соответствующих переданным пользователям ИБ.
//
Функция ПолучитьСотрудниковПоИдентификаторПользователяИБ(ПользователиИБ)
	
	МассивИдентификаторов = Новый Массив;
	Если ТипЗнч(ПользователиИБ) = Тип("ПользовательИнформационнойБазы") Тогда
		МассивИдентификаторов.Добавить(ПользователиИБ.УникальныйИдентификатор);
	ИначеЕсли ТипЗнч(ПользователиИБ) = Тип("Массив") Тогда
		Для каждого Пользователь из ПользователиИБ Цикл
			МассивИдентификаторов.Добавить(Пользователь.УникальныйИдентификатор);		
		КонецЦикла;
	КонецЕсли;
	
	Запрос = Новый Запрос(	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Пользователи.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	Пользователи.ИдентификаторПользователяИБ В(&ИдентификаторПользователяИБ)
	|	И Пользователи.ПометкаУдаления = ЛОЖЬ
	|	И Пользователи.ЭтоПользовательИБ = ИСТИНА");
	
	Запрос.УстановитьПараметр("ИдентификаторПользователяИБ", МассивИдентификаторов);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

// Функция, возвращает список пользователей, соответсвующих переданным сотрудникам.
Функция ПолучитьСписокСотрудниковПоСотрудникам(Сотрудники)
	
	// Проверяем, если массив с Пользователями возвращаем его.
	Если ТипЗнч(Сотрудники) = Тип("Массив") Тогда
		Для каждого Сотрудник из Сотрудники Цикл
			Если ТипЗнч(Сотрудник) = Тип("СправочникСсылка.Пользователи") Тогда
				ПользователиИБ = Истина;
				Возврат Сотрудники; 
			Иначе
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Пользователи.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	Пользователи.Сотрудник В(&Сотрудники)
	|	И Пользователи.ПометкаУдаления = ЛОЖЬ
	|	И Пользователи.ЭтоПользовательИБ = ИСТИНА");
	Запрос.УстановитьПараметр("Сотрудники", Сотрудники);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

// Функция, удаляет дубли из массива пользователей и возвращает результат.
//
Функция ПолучитьМассивУникальныхПользователей(ПользователиИБ)
	
	Результат					 = Новый Массив;
	СоответствиеПользователей	 = Новый Соответствие;
	
	Для Каждого Пользователь Из ПользователиИБ Цикл
		СоответствиеПользователей.Вставить(Пользователь.УникальныйИдентификатор, Пользователь);
	КонецЦикла;
	
	Для Каждого Пользователь Из СоответствиеПользователей Цикл
		Результат.Добавить(Пользователь.Значение);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Создает нового пользователя системы взаимодействий и заполняет его данными пользователя
// информационной базы.
//
// Выбрасывает исключение, если не удалось создать нового пользователя системы Взаимодействия.
//
// Параметры:
// 	Пользователь - СправочникиСсылка.Пользователи - пользователь, для которого будет создан
//													пользователь системы взаимодействия.
// Возвращаемое значение:
// 	ПользовательСистемыВзаимодействия
//
Функция НовыйПользовательСистемыВзаимодействия(Пользователь)
	
	ОписаниеПользователя = ОписаниеПользователя(Пользователь);
	
	Если НЕ ЗначениеЗаполнено(ОписаниеПользователя.ИдентификаторПользователяИБ) Тогда
		ВызватьИсключение НСтр("ru='Не существует пользователь информационной базы'");
	КонецЕсли;
	
	ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ОписаниеПользователя.ИдентификаторПользователяИБ);
	ПользовательСВ = СистемаВзаимодействия.СоздатьПользователя(ПользовательИБ);
	
	ОбновитьОписаниеПользователяВСистемеВзаимодействия(ПользовательСВ, ОписаниеПользователя);
	
	Возврат ПользовательСВ;
	
КонецФункции

Процедура ОбновитьОписаниеПользователяВСистемеВзаимодействия(ПользовательСВ, ОписаниеПользователя)
	
	Фотография = ОписаниеПользователя.ФайлКартинки;
	Если Фотография <> Неопределено Тогда 	
		ДанныеКартинки = РаботаСФайламиВызовСервера.ПолучитьДанныеФайлаИДвоичныеДанные(Фотография);
		ПользовательСВ.Картинка = Новый Картинка(ДанныеКартинки.ДвоичныеДанные);
	КонецЕсли;
	
	ПользовательСВ.Заблокирован = ОписаниеПользователя.ПометкаУдаления;
	
	УстановитьПривилегированныйРежим(Истина);
	ПользовательСВ.Записать();
	
КонецПроцедуры
 
Функция ОписаниеПользователя(Пользователь)
	
	Результат = Новый Структура;
	Результат.Вставить("Наименование"				, "");
	Результат.Вставить("ИдентификаторПользователяИБ", "");
	Результат.Вставить("ФайлКартинки");
	Результат.Вставить("ПометкаУдаления"			, Истина);
	
	СвойстваПользователя = ?(ТипЗнч(Пользователь) = Тип("СправочникОбъект.Сотрудники"),
	Пользователь,
	ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Пользователь,
	" Наименование,
	| ИдентификаторПользователяИБ,
	| ФайлКартинки,
	| ПометкаУдаления"));
	ЗаполнитьЗначенияСвойств(Результат, СвойстваПользователя);
	
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьПолучателей(ПолучателиПриемник, ПолучателиИсточник)
	
	Если ПолучателиИсточник.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПолучателиПользователиИБ = ТипЗнч(ПолучателиИсточник) = Тип("Соответствие") 
	ИЛИ (ТипЗнч(ПолучателиИсточник) = Тип("Массив") 
	И ТипЗнч(ПолучателиИсточник[0]) = Тип("СправочникСсылка.Пользователи"));
	
	Если ПолучателиПользователиИБ Тогда
		Для каждого Получатель Из ПолучателиИсточник Цикл
			
			Если Получатель.Значение <> Неопределено Тогда
				ПолучателиПриемник.Добавить(Получатель.Значение.Идентификатор);
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе	
		Для каждого Получатель Из ПолучателиИсточник Цикл
			Если ТипЗнч(Получатель) = Тип("ИдентификаторПользователяСистемыВзаимодействия") Тогда
				ПолучателиПриемник.Добавить(Получатель);
			Иначе	
				ПолучателиПриемник.Добавить(Получатель.Идентификатор);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Функция ЭлементСоответствия(Соответствие, Индекс)
	
	Сч = 0;
	Для каждого КлючЗначение Из Соответствие Цикл
		Если Сч = Индекс Тогда
			Возврат КлючЗначение;
		КонецЕсли;
		Сч = Сч + 1;
	КонецЦикла;
	
КонецФункции

// Параметры:
//  Автор	 - ИдентификаторПользователяСистемыВзаимодействия
//  Участник - ИдентификаторПользователяСистемыВзаимодействия
// 
// Возвращаемое значение:
//    ОбсуждениеСистемыВзаимодействия
//
Функция НеГрупповоеОбсуждениеМеждуПользователями(Автор, Участник)
	
	Обсуждение = Неопределено;
	
	Отбор = Новый ОтборОбсужденийСистемыВзаимодействия;
	Отбор.КонтекстноеОбсуждение = Ложь;
	Отбор.Групповое 			= Ложь;
	НайденныеОбсуждения = СистемаВзаимодействия.ПолучитьОбсуждения(Отбор);
	
	Для каждого ОтобранноеОбсуждение Из НайденныеОбсуждения Цикл
		Если ОтобранноеОбсуждение.Участники.Содержит(Участник) 
			И ОтобранноеОбсуждение.Участники.Содержит(Автор) Тогда
			
			Обсуждение = ОтобранноеОбсуждение;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Обсуждение = Неопределено Тогда
		Обсуждение = СистемаВзаимодействия.СоздатьОбсуждение();
		Обсуждение.Отображаемое = Истина;
		Обсуждение.Групповое = Ложь;
		Обсуждение.Участники.Добавить(Автор);
		Обсуждение.Участники.Добавить(Участник);
		Обсуждение.Записать();
	КонецЕсли;
	
	Возврат Обсуждение;
	
КонецФункции

// Функция, возвращаем массив с идентификаторами пользователей в системе взаимодействия.
//
Функция ПолучателиСообщенияВСистемеВзаимодействия(Сотрудники)
	
	Получатели = Новый Массив;
	
	Если ТипЗнч(Сотрудники) = Тип("Массив") Тогда
		
		Для каждого Сотрудник из Сотрудники Цикл
			
			ИдентификаторПользователяИБ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сотрудник, "ИдентификаторПользователяИБ");	
			Если ЗначениеЗаполнено(ИдентификаторПользователяИБ) Тогда
				Попытка
					ПользовательСистемыВзаимодейтсвия = СистемаВзаимодействия.ПолучитьИдентификаторПользователя(ИдентификаторПользователяИБ);
					Получатели.Добавить(ПользовательСистемыВзаимодейтсвия);
				Исключение
					Продолжить;
				КонецПопытки;
			КонецЕсли;	
			
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(Сотрудники) = Тип("СправочникСсылка.Сотрудники") Тогда	
		
		ИдентификаторПользователяИБ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сотрудники, "ИдентификаторПользователяИБ");	
		Если ЗначениеЗаполнено(ИдентификаторПользователяИБ) Тогда
			Попытка
				ПользовательСистемыВзаимодейтсвия = СистемаВзаимодействия.ПолучитьИдентификаторПользователя(ИдентификаторПользователяИБ);
				Получатели.Добавить(ПользовательСистемыВзаимодейтсвия);
			Исключение
			КонецПопытки;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Получатели;
	
КонецФункции 

// Функция - Оповестить остальных пользователей об изменении
//
// Параметры:
//  Событие	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ОповеститьПользователейОбИзмененииРабочегоСтола(Событие) Экспорт

	ИспользоватьСистемуВзаимодействия = ОбсужденияСистемыВзаимодействия.СистемаВзаимодействияВключена();
	
	Если ИспользоватьСистемуВзаимодействия = Истина Тогда
		
		ТекущиеСеансы 		   = ПолучитьСеансыИнформационнойБазы();
		НомерСеанса   		   = НомерСеансаИнформационнойБазы();
		ПользователиОповещения = Новый Массив;
			
		Для Каждого ТекущийСеанс Из ТекущиеСеансы Цикл
			
			Если НомерСеанса <> ТекущийСеанс.НомерСеанса
				И (ТекущийСеанс.ИмяПриложения = "1CV8C"
				ИЛИ ТекущийСеанс.ИмяПриложения = "WebClient") Тогда
				
				ПользователиОповещения.Добавить(ТекущийСеанс.Пользователь);
			КонецЕсли;
			
		КонецЦикла;
		
		СтруктурнаяЕдиница = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(Событие, "СтруктурнаяЕдиница");
		Дата     		   = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(Событие, "Дата");
		
		Если ЗначениеЗаполнено(ПользователиОповещения) Тогда
			ДанныеСообщения = Новый Структура;
			ДанныеСообщения.Вставить("Ключ"			     , "ОбновлениеРабочегоСтола");
			ДанныеСообщения.Вставить("СтруктурнаяЕдиница", ОбсужденияСистемыВзаимодействия.ПроверитьЗаполненностьЭлемента(СтруктурнаяЕдиница));
			ДанныеСообщения.Вставить("Событие"			 , ОбсужденияСистемыВзаимодействия.ПроверитьЗаполненностьЭлемента(Событие));
			ДанныеСообщения.Вставить("ДатаСобытия"		 , Дата);  
			
			ОбсужденияСистемыВзаимодействия.ДобавитьСообщениеВСистемуВзаимодействия(ДанныеСообщения,, ПользователиОповещения);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

// Функция - Получить идентификатор пользователя системы взаимодействия
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьИдентификаторПользователяСистемыВзаимодействия()
	
	// Проверяем, может ли пользователь рассылки пользоваться СВ
	Попытка
		ИдентификаторПользователя = СистемаВзаимодействия.ИдентификаторТекущегоПользователя();	
	Исключение
	КонецПопытки; 
	
	// Если нельзя пробуем сделать отправку через служебного пользователя.
	Попытка
		Если ИдентификаторПользователя = Неопределено Тогда
			СистемнаяИнформация = Новый СистемнаяИнформация();
			ВерсияПлатформы = СистемнаяИнформация.ВерсияПриложения; 
			
			Если ОбщегоНазначенияКлиентСервер.СравнитьВерсии(ВерсияПлатформы, "8.3.20.0") >= 0 Тогда
				СлужебныйПользователь = ПользователиИнформационнойБазы.НайтиПоИмени("ServiceUserAPI");
				Если СлужебныйПользователь <> Неопределено Тогда
					ПользовательИБ = СлужебныйПользователь.УникальныйИдентификатор;
					СистемаВзаимодействия.УстановитьТекущегоПользователя(ПользовательИБ);
					ИдентификаторПользователя = СистемаВзаимодействия.ИдентификаторТекущегоПользователя();
				КонецЕсли;
			КонецЕсли;
		КонецЕсли; 
	Исключение
		//ЗаписьЖурналаРегистрации(НСтр("ru='Поиск обсуждения Системы взаимодействия по ключу'"), УровеньЖурналаРегистрации.Ошибка,, КлючОбсуждения, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки; 
	
	Возврат ИдентификаторПользователя; 
	
КонецФункции

// Функция - Получить активных пользователей для оповещения
//
// Параметры:
//  СтруктурнаяЕдиница	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьАктивныхПользователейДляОповещения(СтруктурнаяЕдиница) Экспорт

	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	СоединенияИнформационнойБазы.Пользователь КАК Пользователь,
	|	СоединенияИнформационнойБазы.НачалоСоединения КАК НачалоСоединения
	|ПОМЕСТИТЬ ВтАктивныеСотрудники
	|ИЗ
	|	РегистрСведений.СоединенияИнформационнойБазы КАК СоединенияИнформационнойБазы
	|ГДЕ
	|	НЕ СоединенияИнформационнойБазы.Пользователь = &Сотрудник
	|			И НЕ СоединенияИнформационнойБазы.Пользователь = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Сотрудники.Ссылка КАК Сотрудник
	|ПОМЕСТИТЬ ВтСотрудники
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.Ссылка В
	|			(ВЫБРАТЬ
	|				ВтАктивныеСотрудники.Пользователь
	|			ИЗ
	|				ВтАктивныеСотрудники)
	|	И Сотрудники.ДоступныеСтруктурныеЕдиницы.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Сотрудники.Ссылка
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.Ссылка В
	|			(ВЫБРАТЬ
	|				ВтАктивныеСотрудники.Пользователь
	|			ИЗ
	|				ВтАктивныеСотрудники)
	|	И Сотрудники.ДоступныеСтруктурныеЕдиницыЖурналаЗаписи.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ОткрытыеФормы.Сотрудник КАК Сотрудник,
	|	ОткрытыеФормы.ДатаОткрытия КАК ДатаОткрытия,
	|	ВтАктивныеСотрудники.НачалоСоединения КАК НачалоСоединения
	|ИЗ
	|	РегистрСведений.ОткрытыеФормы КАК ОткрытыеФормы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтАктивныеСотрудники КАК ВтАктивныеСотрудники
	|		ПО ОткрытыеФормы.Сотрудник = ВтАктивныеСотрудники.Пользователь
	|ГДЕ
	|	ОткрытыеФормы.Сотрудник В
	|			(ВЫБРАТЬ
	|				ВтСотрудники.Сотрудник
	|			ИЗ
	|				ВтСотрудники)
	|	И (ОткрытыеФормы.ИмяФормы = ""ЖурналЗаписи.Форма""
	|			ИЛИ ОткрытыеФормы.ИмяФормы = ""РабочийКалендарь.ФормаЗаписи"")");
	
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("Сотрудник"	      , ПараметрыСеанса.ТекущийСотрудник);
	
	Выборка = Запрос.Выполнить().Выбрать();
	ПользователиОповещения = Новый Массив;	
	Пока Выборка.Следующий() Цикл
		Если ПользователиОповещения.Найти(Выборка.Сотрудник) = Неопределено  
			И Выборка.ДатаОткрытия >= Выборка.НачалоСоединения Тогда
			
			ПользователиОповещения.Добавить(Выборка.Сотрудник);
		КонецЕсли;
	КонецЦикла;

	Возврат ПользователиОповещения;
	
КонецФункции

#КонецОбласти
